app/Controllers/Admin.php

    public function clases()
    {
        $claseModel = new ClaseModel();
        $clases = $claseModel->findAll();
---
SELECT *
FROM `clases`