app/Controllers/Admin.php

    public function dashboard_admin()
    {
        $usuarioModel = new DatosUsuarioModel();
        $claseModel = new ClaseModel();
        $reservaModel = new ReservaModel();

        $data = [
            'usuarios' => $usuarioModel->countAll(),
            'clases'   => $claseModel->countAll(),
            'reservas' => $reservaModel->countAll(),
        ];
---
SELECT COUNT(*) AS `numrows` FROM `datos_usuarios`
SELECT COUNT(*) AS `numrows` FROM `clases`
SELECT COUNT(*) AS `numrows` FROM `reservas`

    public function usuarios()
    {
        $usuarioModel = new DatosUsuarioModel();
        $perfilModel  = new PerfilModel();
        $planModel    = new PlanModel();

        $usuarios = $usuarioModel->findAll();
---
SELECT *
FROM `usuarios`

    public function editar_usuario($id = null)
    {
        $usuarioModel = new DatosUsuarioModel();
        $perfilModel  = new PerfilModel();
        $planModel    = new PlanModel();

        $usuario = $usuarioModel->find($id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '6'