app/Controllers/Usuario.php

SELECT *
FROM `datos_usuarios`
WHERE `datos_usuarios`.`id_usuario` = 1
---
    public function dashboard_usuario()
    {
        $usuarioModel = new DatosUsuarioModel();
        $reservaModel = new ReservaModel();

        // Usuario temporal (hasta implementar login)
        $idUsuario = 1;
        $usuario = $usuarioModel->find($idUsuario);