app/Models/ClaseModel.php

SELECT *
FROM `clases`
WHERE `cupo_disponible` > 0
---
    public function getDisponibles()
    {
        return $this->where('cupo_disponible >', 0)->findAll();