app/Models/PerfilModel.php

    public function login($usuario, $password)
    {
        return $this->where('nombre_usuario', $usuario)
                    ->where('contraseña', $password)
                    ->first();
---
SELECT *
FROM `perfil`
WHERE `nombre_usuario` = 'juan'
AND `contraseña` = '123'
 LIMIT 1