app/Models/ReservaModel.php

SELECT `reservas`.*, `usuarios`.`nombre` as `usuario`, `clases`.`hora`
FROM `reservas`
JOIN `usuarios` ON `usuarios`.`id` = `reservas`.`usuario_id`
JOIN `clases` ON `clases`.`id` = `reservas`.`clase_id`
---
    public function getAll()
    {
        return $this->select('reservas.*,
                              datos_usuarios.nombre as usuario,
                              clases.nombre as clase,
                              clases.hora_inicio,
                              clases.hora_fin')
                    ->join('datos_usuarios', 'datos_usuarios.id_usuario = reservas.id_usuario')
                    ->join('clases', 'clases.id_clases = reservas.id_clases')
                    ->findAll();

SELECT `reservas`.*, `clases`.`nombre` as `clase`, `clases`.`hora_inicio`, `clases`.`hora_fin`
FROM `reservas`
JOIN `clases` ON `clases`.`id_clases` = `reservas`.`id_clases`
WHERE `reservas`.`id_usuario` = 1
---
    public function getByUsuario($id_usuario)
    {
        return $this->select('reservas.*,
                              clases.nombre as clase,
                              clases.hora_inicio,
                              clases.hora_fin')
                    ->join('clases', 'clases.id_clases = reservas.id_clases')
                    ->where('reservas.id_usuario', $id_usuario)
                    ->findAll();