app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = 1
---
    public function getById($id)
    {
        return $this->find($id);